# People Analytics Case Study - Using Functions

## 1. Libraries and Setup

In [2]:
# import libraries
import pandas as pd
from src.functions import *

In [3]:
# Create database connection
engine = create_db_connection('hr_data', 'password')

## 2. Data Analysis

In [4]:
# 1. Gender breakdown
gender_breakdown = get_gender_breakdown(engine)
gender_breakdown

           gender  count
0            Male  10273
1          Female   9361
2  Non-Conforming    549

In [5]:
# 2. Race/ethnicity breakdown
race_breakdown = get_race_breakdown(engine)
race_breakdown

                                        race  count
0                                      White   5755
1                          Two or More Races   3309
2                  Black or African American   3298
3                                      Asian   3232
4                         Hispanic or Latino   2263
5           American Indian or Alaska Native   1216
6  Native Hawaiian or Other Pacific Islander   1110

In [6]:
# 3. Age distribution
age_range, age_distribution = get_age_distribution(engine)
age_range, age_distribution

(   max_age  min_age
 0       56       19,
   age_group  count
 0     20-29   5820
 1     30-39   5611
 2     40-49   5370
 3     50-59   3382)

In [7]:
# 4. Turnover rates per year
turnovers_per_year = get_turnover_rates(engine)
turnovers_per_year

    year  turnover_rate
0   2004            0.4
1   2005            0.5
2   2006            1.6
3   2007            1.5
4   2008            2.6
5   2009            3.6
6   2010            2.6
7   2011            4.6
8   2012            3.9
9   2013            6.1
10  2014            4.7
11  2015            6.5
12  2016            5.9
13  2017            6.1
14  2018            6.9
15  2019            7.5
16  2020            8.1
17  2021            8.7
18  2022            9.3
19  2023            8.7

## 3. Export Data for Visualization

In [8]:
# Export cleaned data
df_sql = pd.read_sql("SELECT * FROM hr_data.employees", con=engine)
export_to_csv(df_sql, '../data/cleaned/hr_data_cleaned.csv')

In [9]:
# Export turnover rates
export_to_csv(turnovers_per_year, '../data/cleaned/turnovers_per_year.csv')